marcorussi/nrf51_multi_nus_central/conn_manager.c
/*
 * The MIT License (MIT)
 *
 * Copyright (c) [2015] [Marco Russi]
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
*/


/* ---------- Inclusions ---------- */

/* Compiler libraries */
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>
/* Nordic common library */
#include "nordic_common.h"

/* softdevice handler */
#include "softdevice_handler.h"

/* nrf drivers */
#include "nrf.h"
#include "nrf_gpio.h"

/* UTIL component */
#include "util.h"

/* BLE components */
#include "ble.h"
#include "ble_gap.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_nus_c.h"	/* NUS central */
#include "ble_nus.h"	/* NUS peripheral */
#include "ble_db_discovery.h"

/* UART component */
#include "uart_manager.h"

/* APP components */
#include "app_error.h"
#include "app_uart.h"
#include "app_timer.h"

/* header file */
#include "conn_manager.h"




/* ---------- Local definitions ---------- */

/* Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */
#define IS_SRVC_CHANGED_CHARACT_PRESENT	0  
                                         
/* Name of device. Will be included in the advertising data. */
#define DEVICE_NAME            	"ble_led_cube"     

/* Default target device name and length */
#define TARGET_DEV_NAME      	"ble_led_ctrl_01"  
#define TARGET_DEV_LENGTH      	15 

/* NUS service UUID type */                                                                
#define NUS_SERVICE_UUID_TYPE   BLE_UUID_TYPE_VENDOR_BEGIN      /**< UUID type for the Nordic UART Service (vendor specific). */
                                                                
/* Scanning parameters */                                                            
#define SCAN_INTERVAL           0x00A0                          /**< Determines scan interval in units of 0.625 millisecond. */
#define SCAN_WINDOW             0x0050                          /**< Determines scan window in units of 0.625 millisecond. */
#define SCAN_ACTIVE             1                               /**< If 1, performe active scanning (scan requests). */
#define SCAN_SELECTIVE          0                               /**< If 1, ignore unknown devices (non whitelisted). */
#define SCAN_TIMEOUT            0x0000                          /**< */
       
/* GAP connection parameters */                                                         
#define MIN_CONNECTION_INTERVAL MSEC_TO_UNITS(20, UNIT_1_25_MS) /**< Determines minimum connection interval in millisecond. */
#define MAX_CONNECTION_INTERVAL MSEC_TO_UNITS(75, UNIT_1_25_MS) /**< Determines maximum connection interval in millisecond. */
#define SLAVE_LATENCY           0                               /**< Determines slave latency in counts of connection events. */
#define SUPERVISION_TIMEOUT     MSEC_TO_UNITS(4000, UNIT_10_MS) /**< Determines supervision time-out in units of 10 millisecond. */

/* The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_INTERVAL                64      

/* The advertising timeout (in units of seconds). */                                    
#define APP_ADV_TIMEOUT_IN_SECONDS      10    
             
/* Value of the RTC1 PRESCALER register. */   
#define APP_TIMER_PRESCALER             0   

/* Maximum number of simultaneously created timers. */                                                   
#define APP_TIMER_MAX_TIMERS            2	

/* Size of timer operation queues. */				    
#define APP_TIMER_OP_QUEUE_SIZE         4   
  
/* Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */          
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER) 

/* Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */ 
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) 

/* Number of attempts before giving up the connection parameter negotiation. */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3    

/* UUID fields sizes */                                                 
#define UUID16_SIZE             		2                            
#define UUID32_SIZE	        			4                              
#define UUID128_SIZE            		16                          

/* Device list length */
#define DEVICE_LIST_LENGTH				6	

/* Max data length through NUS service */
#define MAX_DATA_LENGTH					BLE_NUS_MAX_DATA_LEN

/* connection pin number */
#define CONN_PIN_NUMBER 				21	/* P0.21 */

/* connection pin state as connected */
#define CONNECTED_PIN_STATE				1	/* high */

/* connection pin state as disconnected */
#define DISCONNECTED_PIN_STATE			0	/* low */




/* ---------- Local structures definition ---------- */

/* Device list length */
typedef struct
{
	ble_gap_addr_t gap_addr;
	uint8_t name[21];
	uint8_t name_length;
	uint8_t valid_target;
} device_info;




/* ---------- Local variables ---------- */

/* Structure to identify the Nordic UART peripheral service. */
static ble_nus_t                        m_ble_nus_p;    

/* Handle of the current connection. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    

/* Universally unique service identifier. */
static ble_uuid_t                       m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};  

/* Structure to identify the Nordic UART central service. */
static ble_nus_c_t              m_ble_nus_c;

