marcorussi/nrf51_multi_nus_central/conn_manager.c
    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/* CENTRAL: Reads an advertising report and checks if the target name is present.
   Parameters: p_adv_report  Pointer to the advertisement report.
   Return: true if the target name is present in the advertisement report. Otherwise false  
*/
static bool is_target_name_present(const ble_gap_evt_adv_report_t *p_adv_report, uint8_t *name_string, uint8_t *name_length)
{
    uint32_t index = 0;
    uint8_t *p_data = (uint8_t *)p_adv_report->data;
    
    while (index < p_adv_report->dlen)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type   = p_data[index+1];

		/* check target name */
		if ( field_type == BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME )
		{
			/* copy name string */
			strncpy((char *)name_string, (char *)(&p_data[index + 2]), (size_t)field_length);

			/* copy name length */
			*name_length = field_length;
			
			/* Name found */
		  	return true;
	   	    
		}

        index += field_length + 1;
    }

    return false;
}


/* CENTRAL: Reads an advertising report and checks if a uuid is present in the service list.
   The function is able to search for 16-bit, 32-bit and 128-bit service uuids. 
   Parameters: p_target_uuid The uuid to search fir
               p_adv_report  Pointer to the advertisement report.
   Return: true if the UUID is present in the advertisement report. Otherwise false  
*/
static bool is_uuid_present(const ble_uuid_t *p_target_uuid, 
                            const ble_gap_evt_adv_report_t *p_adv_report)
{
    uint32_t err_code;
    uint32_t index = 0;
    uint8_t *p_data = (uint8_t *)p_adv_report->data;
    ble_uuid_t extracted_uuid;
    
    while (index < p_adv_report->dlen)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type   = p_data[index+1];

		/* check UUID field */
        if ( (field_type == BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE)
           || (field_type == BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE) )
        {
            for (uint32_t u_index = 0; u_index < (field_length/UUID16_SIZE); u_index++)
            {
                err_code = sd_ble_uuid_decode(  UUID16_SIZE, 
                                                &p_data[u_index * UUID16_SIZE + index + 2], 
                                                &extracted_uuid);
                if (err_code == NRF_SUCCESS)
                {
                    if ((extracted_uuid.uuid == p_target_uuid->uuid)
                        && (extracted_uuid.type == p_target_uuid->type))
                    {
                        return true;
                    }
                }
            }
        }
        else if ( (field_type == BLE_GAP_AD_TYPE_32BIT_SERVICE_UUID_MORE_AVAILABLE)
                || (field_type == BLE_GAP_AD_TYPE_32BIT_SERVICE_UUID_COMPLETE) )
        {
            for (uint32_t u_index = 0; u_index < (field_length/UUID32_SIZE); u_index++)
            {
                err_code = sd_ble_uuid_decode(UUID16_SIZE, 
                &p_data[u_index * UUID32_SIZE + index + 2], 
                &extracted_uuid);
                if (err_code == NRF_SUCCESS)
                {
                    if ((extracted_uuid.uuid == p_target_uuid->uuid)
                        && (extracted_uuid.type == p_target_uuid->type))
                    {
                        return true;
                    }
                }
            }
        }
        else if ( (field_type == BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_MORE_AVAILABLE)
                || (field_type == BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_COMPLETE) )
        {
            err_code = sd_ble_uuid_decode(UUID128_SIZE, 
                                          &p_data[index + 2], 
                                          &extracted_uuid);
            if (err_code == NRF_SUCCESS)
            {
                if ((extracted_uuid.uuid == p_target_uuid->uuid)
                    && (extracted_uuid.type == p_target_uuid->type))
                {
                    return true;
                }
            }
        }

        index += field_length + 1;
    }

    return false;
}


/* CENTRAL: Function for getting the device id of the found devices list.
   Parameters: gap_addr   Bluetooth low energy address.
*/
static uint8_t get_devices_list_id(ble_gap_addr_t gap_addr)
{
	uint8_t device_index = 0;

	/* check address type - TODO */
	//if(gap_addr.addr_type == BLE_GAP_ADDR_TYPE_PUBLIC)

	/* seek address in found device list */
	while( (0 != strncmp((const char *)(gap_addr.addr), (const char *)(found_devices[device_index].gap_addr.addr), (size_t)6))
	&&	   (device_index < devices_list_index) )
	{
		device_index++;
	}

	/* if the address has not been found in the list */
	if(device_index >= devices_list_index)
	{
		/* return "not found" value */
		device_index = 0xFF;
	}

	return device_index;
}


/* Function for handling the Application's BLE Stack events.
   Parameters: p_ble_evt   Bluetooth stack event.
*/
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code;
	uint8_t index = 0;
    const ble_gap_evt_t * p_gap_evt = &p_ble_evt->evt.gap_evt;	
    
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
        {
            const ble_gap_evt_adv_report_t *p_adv_report = &p_gap_evt->params.adv_report;

			index = get_devices_list_id(p_adv_report->peer_addr);
			/* id device has been already found */
			if( index != 0xFF)
			{
				/* device already found */
				/* new adv update */
			}
			else
			{
				/* get last free index */
				index = devices_list_index;
				/* increment last free index */
				devices_list_index++;
				/* insert the new device into the list */
				/* copy address */
				strncpy((char *)(found_devices[index].gap_addr.addr), (char *)(p_adv_report->peer_addr.addr), (size_t)6);
				/* copy address type */
				found_devices[index].gap_addr.addr_type = p_adv_report->peer_addr.addr_type;
			}

			/* if scan response */
			//if(p_adv_report->scan_rsp == 1)
			//{
				if (is_target_name_present(p_adv_report, found_devices[index].name, &found_devices[index].name_length))
				{
					found_devices[index].valid_target |= 1;
				}	
			//}
			/* else if advertisement */
			//else
			//{
				if (is_uuid_present(&m_nus_uuid, p_adv_report))
			    {
					found_devices[index].valid_target |= 2;
				}
			//}
            break;
        }
        
        case BLE_GAP_EVT_CONNECTED:
			/* if role is central */
			if(connection_state == CONN_KE_INIT_C)
			{
				uart_send_string((uint8_t *)"CONNECTED.", 10);
				/* device is connected as central to a peripheral */
				connection_state = CONN_KE_CONNECTED_C;
				/* set "connection" pin as connected */
				nrf_gpio_pin_write(CONN_PIN_NUMBER, CONNECTED_PIN_STATE);
				/* reset uart */
				uart_reset();

