marcorussi/nrf51_multi_nus_central/conn_manager.c
		        m_ble_nus_c.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
		        /* start discovery of services. The NUS Client waits for a discovery result */
		        err_code = ble_db_discovery_start(&m_ble_db_discovery, p_ble_evt->evt.gap_evt.conn_handle);
		        APP_ERROR_CHECK(err_code);
			}
			/* else if role is peripheral */
			else if(connection_state == CONN_KE_INIT_P)
			{
				/* device is connected as peripheral to a central */
				connection_state = CONN_KE_CONNECTED_P;
				/* set "connection" pin as connected */
				nrf_gpio_pin_write(CONN_PIN_NUMBER, CONNECTED_PIN_STATE);
			}
			else
			{
				/* do nothing */
			}
            break;

		case BLE_GAP_EVT_DISCONNECTED:
			/* if role is peripheral */
			if(connection_state == CONN_KE_CONNECTED_P)
			{
				/* device is not connected now */
				connection_state = CONN_KE_INIT_P;
				/* set "connection" pin as disconnected */
				nrf_gpio_pin_write(CONN_PIN_NUMBER, DISCONNECTED_PIN_STATE);
			}
			else
			{
				/* do nothing at the moment */
			}
            break;
    
        case BLE_GAP_EVT_TIMEOUT:
            if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN)
            {
                /* scan timed out */
				uart_send_string((uint8_t *)"TIMEOUT.", 8);
            }
            else if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
            {
                /* connection request timed out: do nothing */
            }
			else
			{
				/* do nothing */
			}
            break;
            
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            /* Pairing not supported */
            err_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
			//err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break;
    
        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
            /* Accepting parameters requested by peer. */
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                                    &p_gap_evt->params.conn_param_update_request.conn_params);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;
    
        default:
            break;
    }
}


/* CENTRAL: Callback handling NUS Client events.
   Handling events from the ble_nus_c module.
   This function is called to notify the application of NUS client events.
   Parameters: p_ble_nus_c   NUS Client Handle. This identifies the NUS client
               p_ble_nus_evt Pointer to the NUS Client event.
*/
static void ble_nus_c_evt_handler(ble_nus_c_t * p_ble_nus_c, const ble_nus_c_evt_t * p_ble_nus_evt)
{
    uint32_t err_code;
    switch (p_ble_nus_evt->evt_type)
    {
        case BLE_NUS_C_EVT_FOUND_NUS_TX_CHARACTERISTIC:
            /* TX characteristic found */
            break;
        
        case BLE_NUS_C_EVT_FOUND_NUS_RX_CHARACTERISTIC:
	    	/* RX characteristic found: enable notification on that */
            err_code = ble_nus_c_rx_notif_enable(p_ble_nus_c);
            APP_ERROR_CHECK(err_code);
            break;
        
        case BLE_NUS_C_EVT_NUS_RX_EVT:
			/* send received data from NUS to uart interface */
            for (uint32_t i = 0; i < p_ble_nus_evt->data_len; i++)
            {
                while(app_uart_put( p_ble_nus_evt->p_data[i]) != NRF_SUCCESS);
            }
            break;
        
        case BLE_NUS_C_EVT_DISCONNECTED:
			/* device is not connected as central anymore */
			connection_state = CONN_KE_INIT_C;
			/* reset uart */
			uart_reset();
			uart_send_string((uint8_t *)"DISCONNECTED.", 13);
			/* set "connection" pin as disconnected */
			nrf_gpio_pin_write(CONN_PIN_NUMBER, DISCONNECTED_PIN_STATE);
            break;
    }
}


/* Function for handling the data from the Nordic UART Service.
   This function will process the data received from the Nordic UART BLE Service and send
   it to the UART module */
static void ble_nus_p_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
	/* send received data from NUS to uart interface */
	for (uint32_t i = 0; i < length; i++)
    {
        while(app_uart_put(p_data[i]) != NRF_SUCCESS);
    }
    app_uart_put(0x0D);
	app_uart_put(0x0A);
}


/* CENTRAL: Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
   This function is called from the scheduler in the main loop after a BLE stack event has
   been received.
   Parameters: p_ble_evt   Bluetooth stack event.
*/
static void ble_c_evt_dispatch(ble_evt_t * p_ble_evt)
{
    on_ble_evt(p_ble_evt);  
    ble_db_discovery_on_ble_evt(&m_ble_db_discovery, p_ble_evt);
    ble_nus_c_on_ble_evt(&m_ble_nus_c,p_ble_evt);
}


/* PERIPHERAL: Function for dispatching a S110 SoftDevice event to all modules with a S110 SoftDevice 
   event handler.
   This function is called from the S110 SoftDevice event interrupt handler after a S110 
   SoftDevice event has been received */
static void ble_p_evt_dispatch(ble_evt_t * p_ble_evt)
{
    ble_conn_params_on_ble_evt(p_ble_evt);
    ble_nus_on_ble_evt(&m_ble_nus_p, p_ble_evt);
    on_ble_evt(p_ble_evt);
    ble_advertising_on_ble_evt(p_ble_evt);  
}


/* Function for initializing the BLE stack.
   Initializes the SoftDevice and the BLE event interrupt.
*/
static void ble_stack_init(bool is_central)
{
    uint32_t err_code;

    /* Initialize the SoftDevice handler module. */
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, NULL);

    /* Enable BLE stack. */
    ble_enable_params_t ble_enable_params;
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));

    ble_enable_params.gatts_enable_params.attr_tab_size   = BLE_GATTS_ATTR_TAB_SIZE_DEFAULT;

	/* if central role is required */
	if(is_central == true)
	{
		ble_enable_params.gatts_enable_params.service_changed = false;
	}
	/* else if peripheral role or other invalid values */
	else
	{
		ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
	}

	/* enable BLE */
    err_code = sd_ble_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

	/* if central role is required */
	if(is_central == true)
	{
		/* Register with the SoftDevice handler module for BLE events in central role */
		err_code = softdevice_ble_evt_handler_set(ble_c_evt_dispatch);
		APP_ERROR_CHECK(err_code);
	}
	/* else if peripheral role or other invalid values */
	else
	{
		/* Register with the SoftDevice handler module for BLE events in peripheral role */
		err_code = softdevice_ble_evt_handler_set(ble_p_evt_dispatch);
		APP_ERROR_CHECK(err_code);
	}
}


/* PERIPHERAL: Function for initializing services that will be used by the application */
static void nus_p_init(void)
{
    uint32_t       err_code;
    ble_nus_init_t nus_p_init_t;
    
    memset(&nus_p_init_t, 0, sizeof(nus_p_init_t));

    nus_p_init_t.data_handler = ble_nus_p_data_handler;
    
    err_code = ble_nus_init(&m_ble_nus_p, &nus_p_init_t);
    APP_ERROR_CHECK(err_code);
}


/* Function for initializing the NUS Client. */
static void nus_c_init(void)
{
    uint32_t         err_code;
    ble_nus_c_init_t nus_c_init_t;
    
    nus_c_init_t.evt_handler = ble_nus_c_evt_handler;
    
    err_code = ble_nus_c_init(&m_ble_nus_c, &nus_c_init_t);
    APP_ERROR_CHECK(err_code);
}





/* End of file */



